#include <iostream>
#include <cmath>
#include <math.h>

using namespace std;

void LAB2() {
    double A[] = { 0, -9, -4, 1.5 };
    double RES[2];
    A[0] = 0.5 * pow(10, -8);

    RES[0] = A[0] * A[1] + A[3] * sqrt(A[1] - 1);
    RES[1] = 0.5 * RES[0] / A[0] + exp(A[3]);
    cout << "\t\tЛаба №2(13 вариант)\nt == " << RES[0] << "\ny == " << RES[1] << endl;
    cout << "Ошибки в коде тут нету, просто компьютор, ну и лично я, не знаем как доставать корень отрицательных чисел => программа ломается.(\n";
    cout << "Но я как ответственный парень решил продолжить и исправить ошибку, так что c == 9. -.-\n";

    RES[0] = A[0] * A[1] + A[3] * sqrt((-A[1]) - 1);
    RES[1] = 0.5 * RES[0] / A[0] + exp(A[3]);
    cout << "t == " << RES[0] << "\ny == " << RES[1] << endl;

    cout << "А ещё решил сделать другие варианты.)\n";
    cout << "\t\t(1 вариант)\n";
    A[0] = 4;
    A[1] = 2 * pow(10, -4);
    A[2] = 8.1;
    RES[0] = 2 * A[0] / A[2] + log(2 + A[1]);
    RES[1] = sqrt(A[0] - 1) / (RES[0] + 1);
    cout << "t == " << RES[0] << "\nu == " << RES[1] << endl;

    cout << "\t\t(4 вариант)\n";
    A[0] = 6;
    A[1] = -1.2;
    A[2] = 0.4 * pow(10, 6);
    RES[0] = 2.6 * A[0] + cos(A[1] / (3 * A[2] + A[1]));
    RES[1] = (sin(A[0])) / (cos(A[0]));
    cout << "p == " << RES[0] << "\nq == " << RES[1] << endl;
}

void LAB3() {
    unsigned char MATRIX13[6][8] = { 0,1,1,0,1,1,0,2,
                                     1,1,1,1,1,1,1,2,
                                     1,1,1,1,1,1,1,2,
                                     0,1,1,1,1,1,0,2,
                                     0,0,1,1,1,0,0,2,
                                     0,0,0,1,0,0,0,2 };//как после объявления массива, заново его переназначить через фигурные скобки???
    unsigned char MATRIX1[6][8] = { 0,0,1,1,1,0,0,2,
                                    0,1,1,1,1,1,0,2,
                                    1,1,1,1,1,1,1,2,
                                    0,0,0,0,0,0,0,2,
                                    0,0,0,0,0,0,0,2,
                                    0,0,0,0,0,0,0,2 };
    unsigned char MATRIX4[6][8] = { 0,0,1,1,1,0,0,2,
                                    0,1,1,1,1,1,0,2,
                                    1,1,1,1,1,1,1,2,
                                    1,1,1,1,1,1,1,2,
                                    0,1,1,1,1,1,0,2,
                                    0,0,1,1,1,0,0,2 };
    float A[3];
    float RES = 0;
    char SYMBOL;
    int J = 0;
    int K = 0;
    
    cout << "\t\tЛаба №3(13 вариант)\nВведите ваш символ: ";
    cin >> SYMBOL;

    while (J < 6) {
        K = 0;
        while (K < 8) {
            if (MATRIX13[J][K] == 0)
                cout << " ";
            if (MATRIX13[J][K] == 1)
                cout << SYMBOL;
            if (MATRIX13[J][K] == 2)
                cout << endl;
            K++;
        }
        J++;
    }
    
    cout << "В бригаде, работающей на уборке сена, имеется N косилок. Первая из них работала M часов, а каждая следующая на 10 мин. Больше, чем предыдущая. Сколько часов работала вся бригада?\n";
    cout << "N == ";
    cin >> A[0];
    cout << "M == ";
    cin >> A[1];
    A[1] *= 60;

    while (A[0] > 0) {
        RES += A[1];
        A[1] += 10;
        A[0]--;
    }

    cout << "Ответ: " << (RES / 60) << " часов.\n";
    J = 0;
    K = 0;

    cout << "\t\t(1 вариант)\nВведите ваш символ: ";
    cin >> SYMBOL;

    while (J < 6) {
        K = 0;
        while (K < 8) {
            if (MATRIX1[J][K] == 0)
                cout << " ";
            if (MATRIX1[J][K] == 1)
                cout << SYMBOL;
            if (MATRIX1[J][K] == 2)
                cout << endl;
            K++;
        }
        J++;
    }

    cout << "Поменять значения двух переменных: а) используя дополнительную переменную; б) не используя дополнительной переменной.\n";
    cout << "A[0] == ";
    cin >> A[0];
    cout << "A[1] == ";
    cin >> A[1];

    A[2] = A[1];
    cout << "а)A[2] = A[1]\n";
    A[1] = A[0];
    cout << "A[1] = A[0]\n";
    A[0] = A[2];
    cout << "A[0] = A[2]\n";
    cout << "A[0] == " << A[0] << endl;
    cout << "A[1] == " << A[1] << endl;

    A[0] += A[1];
    cout << "б)A[0] += A[1]\n";
    A[1] = A[0] - A[1];
    cout << "а)A[1] = A[0] - A[1]\n";
    A[0] -= A[1];
    cout << "а)A[0] -= A[1]\n";
    cout << "A[0] == " << A[0] << endl;
    cout << "A[1] == " << A[1] << endl;
    J = 0;
    K = 0;
    
    cout << "\t\t(4 вариант)\nВведите ваш символ: ";
    cin >> SYMBOL;

    while (J < 6) {
        cout << "\t\t\t\t\t\t\t";
        K = 0;
        while (K < 8) {
            if (MATRIX4[J][K] == 0)
                cout << " ";
            if (MATRIX4[J][K] == 1)
                cout << SYMBOL;
            if (MATRIX4[J][K] == 2)
                cout << endl;
            K++;
        }
        J++;
    }

    cout << "Даны действительные числа X, Y, Z. Определить среднее арифметическое и среднее геометрическое их модулей.\n";
    cout << "X == ";
    cin >> A[0];
    cout << "Y == ";
    cin >> A[1];
    cout << "Z == ";
    cin >> A[2];
    cout << "Среднее арифметическое == " << ((A[0] + A[1] + A[2]) / 3) << endl;
    RES = pow(abs(A[0]) * abs(A[1]) * abs(A[2]), (1.0 / 3));
    cout << "Среднее геометрическое их модулей == " << RES << endl;
}

void main()
{
    setlocale(LC_ALL, "Russian");//Поставили русский в консоле
    char CHECK;
    int NUMBER;

    do {
        system("cls");

        cout << "Выберите лабу(2, 3): ";
        cin >> NUMBER;

        if (NUMBER >= 2 && NUMBER <= 3) {
            if (NUMBER == 2) {
                system("cls");
                LAB2();
            }
            if (NUMBER == 3) {
                system("cls");
                LAB3();
            }
        } else {
            system("cls");
            cout << "Вы ввели не корректное число!" << endl;
        }

        cout << "Повторить цикл?(y/n) ";
        cin >> CHECK;

    } while (CHECK == 'y' || CHECK == 'Y');
}